/*
#include <iostream>
#include <algorithm>

using namespace std;


오름 차 순으로 정렬된 숫자 6개가 저장되는 배열을 선언해 주시고
숫자를 입력받았을 때 그 숫자가 배열 안에서 자기 자리를 찾아가는
프로그램을 만들어보세요.

예를 들어, 1 3 5 7 10 15 이라는 배열이 선언되고
숫자 11이 입력되면 10 과 15 사이에 자리를 찾아가
1 3 5 7 10 11 15 가 출력되는 방식입니다.

◎입력 예제
1 3 5 7 10 15
11

◎출력 예제
1 3 5 7 10 11 15
*/


/*int main() {
	std::cout << "6개의 숫자를 입력해 주세요 :";
	int asc[6] = { 0 };
	
	for (int i = 0; i < 6; i++) { 
		std::cin >> asc[i]; //6개의 숫자 입력
		std::cout << asc[i] << ' ';
	}
	std::cout << endl;
}
*/
